"+ Add" = "+ Hozzáadás";

"Add a card" = "Kártya hozzáadása";

"Add a payment method" = "Fizetési mód hozzáadása";

"Add bank account" = "Bankszámla hozzáadása";

"Add new payment method" = "Új fizetési mód hozzáadása";

"Add your payment information" = "Fizetési adatok megadása";

"Approve payment" = "Fizetés jóváhagyása";

"Back" = "Vissza";

"Bank account" = "Bankszámla";

"Buy now or pay later with Klarna." = "Megvásárlás most, vagy fizetés később Klarnával.";

"Buy using a UPI ID" = "Vásárlás UPI-azonosítóval";

"By confirming your payment with PayPal, you allow %@ to charge your PayPal account for future payments in accordance with their terms." = "A fizetés megerősítésével a PayPalon engedélyezi, hogy a(z) %@ a feltételeinek megfelelően a jövőbeni kifizetésekkel megterhelje a PayPal számláját.";

"By continuing to PayPal, you allow %@ to charge your PayPal account for future payments in accordance with their terms." = "A PayPalra történő továbblépéssel engedélyezi, hogy a(z) %@ a feltételeinek megfelelően a jövőbeni kifizetésekkel megterhelje a PayPal számláját.";

"By continuing to Revolut Pay, you allow %@ to charge your Revolut Pay account for future payments in accordance with their terms." = "A Revolut Payre történő továbblépéssel engedélyezi, hogy a(z) %@ a feltételeinek megfelelően a jövőbeni kifizetésekkel megterhelje a Revolut Pay számláját.";

"By continuing, you agree to authorize payments pursuant to <terms>these terms</terms>." = "A folytatással elfogadja, hogy engedélyezi a kifizetéseket ezen <terms>feltételek</terms> szerint.";

"By continuing, you authorize %@ to debit your Cash App account for this payment and future payments in accordance with %@'s terms, until this authorization is revoked. You can change this anytime in your Cash App Settings." = "Ha folytatja, azzal engedélyezi, hogy a(z) %1$@ megterhelje a Cash App számláját ezzel a fizetéssel, és jövőbeli fizetésekkel a(z) %2$@ feltételeinek megfelelően, ameddig az engedélyt vissza nem vonja. Ezt bármikor megváltoztathatja a Cash App beállításaiban.";

"By joining Link, you agree to the <terms>Terms</terms> and <privacy>Privacy Policy</privacy>." = "A Linkhez történő csatlakozással Őn elfogadja a <terms>feltételeket</terms> és az </privacy>adatvédelmi szabályzatot<privacy>.";

"By providing your payment information and confirming this payment, you authorise (A) %@ and Stripe, our payment service provider, to send instructions to your bank to debit your account and (B) your bank to debit your account in accordance with those instructions. As part of your rights, you are entitled to a refund from your bank under the terms and conditions of your agreement with your bank. A refund must be claimed within 8 weeks starting from the date on which your account was debited. Your rights are explained in a statement that you can obtain from your bank. You agree to receive notifications for future debits up to 2 days before they occur." = "Fizetési adatainak megadásával és a fizetés megerősítésével Ön felhatalmazza (A) a(z) %@ céget és a Stripe-ot, fizetési szolgáltatónkat, hogy utasításokat küldjön a bankjának, hogy megterhelje a számláját, és (B) bankját, hogy az utasításoknak megfelelően megterhelje a számláját. A jogai részeként Ön jogosult a bankjától a velük kötött megállapodás feltételei szerinti visszatérítésre. A visszatérítést a számla megterhelésének napjától számított 8 héten belül kell igényelni. Jogait egy, a bankjától beszerezhető nyilatkozat tartalmazza. Beleegyezik abba, hogy a jövőbeni terhelésekről értesítést kap, legfeljebb 2 nappal azok bekövetkezése előtt.";

"By saving your bank account for %@ you agree to authorize payments pursuant to <terms>these terms</terms>." = "Azzal, hogy elmenti a bankszámlát a(z) %@ számára, beleegyezik a kifizetések engedélyezésébe ezen <terms>feltételek</terms> szerint.";

"CPF/CPNJ" = "CPF/CPNJ";

"Cancel and pay another way" = "Szakítsa meg, és fizessen más módon";

"Choose a payment method" = "Fizetési mód választása";

"Close card scanner" = "Kártyabeolvasó bezárása";

"Confirm" = "Megerősítés";

"Confirm the payment in your bank or payment app within %@ to complete the purchase." = "A vásárlás befejezéséhez %@ percen belül erősítse meg a fizetést a bankjánál vagy a fizetést biztosító alkalmazásban.";

"Confirm the payment in your bank's app within %@ to complete the purchase." = "A vásárlás befejezéséhez %@ percen belül erősítse meg a fizetést bankja alkalmazásában.";

"Contact information" = "Kapcsolattartási adatok";

"EPS Bank" = "EPS Bank";

"Enter address manually" = "Cím megadása kézzel";

"FPX Bank" = "FPX Bank";

"IBAN" = "IBAN";

"Manage your payment methods" = "Fizetési módok kezelése";

"Name on card" = "A kártyán szereplő név";

"Open your UPI app to approve your payment within %@" = "Nyissa meg az UPI-alkalmazását a fizetés jóváhagyásához %@ belül";

"Or" = "vagy";

"Or pay using" = "Vagy fizetés a következővel:";

"Or pay with a card" = "Vagy fizetés kártyával";

"Pay %@" = "%@ kifizetése";

"Pay another way" = "Fizetés más módon";

"Pay faster at %@ and thousands of merchants." = "Gyorsabban fizethet a(z) %@ számára és még ezernyi kereskedőnek.";

"Pay in <num_installments/> interest-free payments of <installment_price/> with <img/>" = "Fizetés <num_installments/>, egyenként <installment_price/> összegű kamatmentes részletben <img/> használatával";

"Pay later with Klarna." = "Fizetés később Klarnával.";

"Pay over time with %@" = "Fizessen később a következővel: %@";

"Pay with Link" = "Fizetés Linkkel";

"Pay with your bank account in just a few steps." = "Fizessen egyszerűen a bankszámlájával.";

"Payment failed" = "A fizetés nem sikerült";

"Please go back and select another payment method" = "Lépjen vissza, és válasszon másik fizetési módot";

"Point the camera at your card." = "Tegye a kártyát a kamera elé.";

"Processing..." = "Feldolgozás...";

"Przelewy24 Bank" = "Przelewy24 Bank";

"Remove %1$@ ending in %2$@" = "%1$@ végződésének eltávolítása: %2$@";

"Remove Card" = "Kártya eltávolítása";

"Save" = "Mentés";

"Save a new payment method" = "Új fizetési mód mentése";

"Save address" = "Cím mentése";

"Save for future payments" = "Mentés a későbbi fizetésekhez";

"Save my info for secure 1-click checkout" = "Adatok mentése a biztonságos egykattintásos fizetéshez";

"Save this account for future %@ payments" = "Számla mentése a(z) %@ részére történő fizetésekhez";

"Save this card for future %@ payments" = "A kártya mentése a(z) %@ részére történő fizetésekhez";

"Save your bank account in just a few steps." = "Mentse el egyszerűen bankszámláját.";

"Select your payment method" = "Fizetési mód kiválasztása";

"Set up" = "Beállítás";

"Shipping to %@ is not supported." = "Ebbe az országba nem támogatott a szállítás: %@";

"Show menu" = "Menü megjelenítése";

"Stripe will deposit $0.01 to your account in 1-2 business days. Then you'll get an email with instructions to finish saving your bank account with %@." = "A Stripe 1-2 munkanapon belül egy 0,01 dollár összegű utalást fog küldeni a bankszámlájára. Ezután e-mailben megkapja az útmutatást a bankszámlája mentéséről a(z) %@ vállalkozáshoz.";

"Stripe will deposit $0.01 to your account in 1-2 business days. Then you’ll get an email with instructions to complete payment to %@." = "A Stripe néhány munkanapon belül egy 0,01 $ összegű utalást fog küldeni a bankszámlájára. Ezután e-mailben megkapja az útmutatást a fizetés befejezéséhez a(z) %@ felé.";

"The IBAN you entered is incomplete." = "A beírt IBAN-szám hiányos.";

"Update card" = "Kártya módosítása";

"Your IBAN should start with a two-letter country code." = "Az IBAN-számának egy kétbetűs országkóddal kell kezdődnie.";

"iDEAL Bank" = "iDEAL bank";
